CREATE TABLE orders_tire
(
    id       SERIAL PRIMARY KEY,
    name     VARCHAR(255),
    price_r_13 INT,
    price_r_14 INT,
    price_r_15 INT,
    price_r_16 INT,
    price_r_17 INT,
    price_r_18 INT,
    price_r_19 INT,
    price_r_20 INT,
    price_r_21 INT,
    price_r_22 INT,
    role     VARCHAR(255)
);

INSERT INTO orders_tire(name, price_r_13, price_r_14, price_r_15, price_r_16, price_r_17,
                        price_r_18, price_r_19, price_r_20, price_r_21, price_r_22,
                        role)
VALUES ('Стандарт_комплекс_4_колес', 900, 1000, 1200, 1300, 1500, 1800,2000,2200,2400,2600,'main'),
       ('Джип,н/профиль_комплекс_4_колес', 0, 0, 1500, 1600, 1900,2100,2300,2500,2700,2900,'main'),
       ('Стандарт_комплекс_1_колесо',300,330,360,390,390,600,510,600,660,720,'main'),
       ('Стандарт_съём/установка',100,110,120,130,130,150,170,200,220,240,'main'),
       ('Стандарт_балансировка',100,110,120,130,130,150,170,200,220,240,'main'),
       ('Стандарт_м/демонтаж',100,110,120,130,130,150,170,200,220,240,'main'),
       ('Джип,н/профиль_комплекс_1_колеса',0,0,480,510,630,690,750,810,900,960,'main'),
       ('Джип,н/профиль_съём/установка',0,0,160,170,210,230,250,270,300,320,'main'),
       ('Джип,н/профиль_балансировка',0,0,160,170,210,230,250,270,300,320,'main'),
       ('Джип,н/профиль_м/демонтаж',0,0,160,170,210,230,250,270,300,320,'main'),
       ('Установка_жгута_1_шт.',200,200,200,200,200,200,200,200,200,200,'additional'),
       ('Установка_камеры_1_колесо',100,100,100,100,100,100,100,100,100,100,'additional'),
       ('Обработка_герметиком_1_колесо',100,100,100,100,100,100,100,100,100,100,'additional'),
       ('Замена_вентеля_1_колесо',100,100,100,100,100,100,100,100,100,100,'additional'),
       ('Замена_ниппеля_1_шт.',50,50,50,50,50,50,50,50,50,50,'additional'),
       ('Пакеты_для_колёс_1_шт.',50,50,50,50,50,50,50,50,50,50,'additional'),
       ('Дошиповка_1_шип',20,20,20,20,20,20,20,20,20,20,'additional'),
       ('Подкачка_1_колесо',15,15,15,15,15,15,15,15,15,15,'additional'),
       ('Мойка_колеса_1_шт.',100,100,100,100,100,100,100,100,100,100,'additional'),
       ('Установка_заплатки',500,500,500,500,500,500,500,500,500,500,'additional'),
       ('Ремонт_бокового_пореза_колеса',500,500,500,500,500,500,500,500,500,500,'additional');







